[
  {
      "companyName" : "National Institute of Mental Health",
      "description" : "Worked with Daniel Weinberger and Kristen K. Nicodemus. Wrote an automated statistical analysis pipeline for candidate gene studies. Wrote software to visualize the results of SNP analyses. Performed analysis in a simulation study assessing power and type I error of single SNP transmission disequilibrium tests (TDTs)\n",
      "location" : "Bethesda, Maryland",
      "startDate" : "10/2005",
      "endDate" : "06/2007",
      "title" : "Post-Baccalaureate Intramural Research Training Award Fellow",
      "_id" : 1,
      "endYear" : "2007"
  },
  {
      "companyName" : "National Cancer Institute",
      "description" : "Worked with Mirit I. Aladjem and Kurt W. Kohn. Worked on standardized representations for biological data (Molecular Interaction Maps (MIMs), Systems Biology Graphical Notation (SBGN), and BioPAX) and related software for MIMs: XML-based format, API, graphical editor, validator, scripting interface, and faceted browser. Worked on an ODE-based model of interactions that connect components of the circadian clock to those of DNA damage response; collaborating with Geoffrey B. McFadden (at NIST). Mentored student projects through the Google Summer of Code Project (2011 and 2012). ",
      "location" : "Bethesda, Maryland",
      "startDate" : "07/2008",
      "endDate" : "08/2013",
      "title" : "Pre-Doctoral Cancer Research Training Award Fellow",
      "_id" : 2,
      "endYear" : "2013"
  },
  {
      "companyName" : "Georgia Institute of Technology",
      "description" : "Worked with Andreas Bommarius and Karen M. Polizzi. Created an expression vector for mutant variants in a high throughput screen. Collected information on antibiotic resistance in E.coli due to beta-lactamase\n",
      "location" : "",
      "startDate" : "09/2004",
      "endDate" : "05/2005",
      "title" : "Undergraduate Research Assistant",
      "_id" : 3,
      "endYear" : "2005"
  },
  {
      "companyName" : "Boston University",
      "description" : "Worked with Daniel Segrè. Worked on a metabolic network to represent a kidney cell using BIGG human metabolic network and microarray data from the GEO repository for flux balance analysis. ",
      "location" : "",
      "startDate" : "08/2007",
      "endDate" : "07/2013",
      "title" : "Bioinformatics PhD Student",
      "_id" : 4,
      "endYear" : "2013"
  },
  {
      "companyName" : "Pfizer",
      "description" : "Worked with Jacob Glanville. Developed a wiki-based platform for the analysis and collaborative annotation of experimental results.",
      "location" : "",
      "startDate" : "06/2010",
      "endDate" : "07/2010",
      "title" : "Intern",
      "_id" : 5,
      "endYear" : "2010"
  },
  {
      "companyName" : "Memorial Sloan-Kettering Cancer Center",
      "description" : "Worked with Chris Sander. Working on standardized representations of biological data (BioPAX), the aggregation of multiple pathway databases into Pathway Commons, and related software, including: Paxtools and paxtoolsR. In collaboration with the Yves Pommier lab of the Developmental Therapeutics Branch at the NCI, working to identify novel drug-target interactions using compound activity from the NCI Developmental Therapeutics Program (DTP) and genomic profiling data of the NCI-60 cancer cell lines. Compounds are prioritized for further development using understanding of pharmacology, target pathway context, relevance to cancer, and novelty. ",
      "location" : "",
      "startDate" : "09/2013",
      "endDate" : "10/2015",
      "title" : "Research Fellow",
      "_id" : 6,
      "endYear" : "2015"
  },
  {
      "companyName" : "Georgia Institute of Technology",
      "description" : "Worked with Allen Tannenbaum and Eli Hershkovitz. Worked on the classification of RNA classification into motif libraries. Wrote programs to parse tRNA X-ray crystallography data\n",
      "location" : "",
      "startDate" : "09/2003",
      "endDate" : "05/2004",
      "title" : "Undergraduate Research Assistant",
      "_id" : 7,
      "endYear" : "2004"
  },
  {
      "companyName" : "Dana-Farber Cancer Institute",
      "description" : "Work with Chris Sander. Develop R packages for cancer pharmacology research, including cgdsr (CBioPortal, TCGA studies), paxtoolsr (Pathway Commons), rcellminer (NCI-60 cell lines). Develop R based integrative analyses and bioinformatics pipelines with a focus on reproducibility using Docker. Develop web applications for cancer pharmacology databases and analyses. Work on tools to conduct complex pathway analyses using the aggregated Pathway Commons database. Work to identify novel drug-target interactions using compound activity from the NCI Developmental Therapeutics Program (DTP) and omic profiling data of the NCI-60 cancer cell lines in collaboration with the Developmental Therapeutics Branch at the NCI, the Genomics of Drug Sensitivity in Cancer Project at the Sanger Institute, and the Institute of Molecular Systems Biology at ETH Zurich. Work to identify novel drug combinations for cancer using proteomics data. ",
      "location" : "",
      "startDate" : "11/2015",
      "endDate" : "Present",
      "title" : "Research Fellow",
      "_id" : 8,
      "endYear" : "2016"
  }
]
